; domain
(define (domain zeno-travel)
(:requirements :typing)
(:types aircraft person - locatable
	locatable city flevel - object)
(:predicates (at ?x - locatable ?c - city)
             (in ?p - person ?a - aircraft)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 ?l2 - flevel))


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)))

(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)

 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 - flevel)
 
 :precondition (and (at ?a ?c1)
                 (fuel-level ?a ?l1)
		 (next ?l2 ?l1))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l2)))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 ?l3 - flevel)

 :precondition (and (at ?a ?c1)
                 (fuel-level ?a ?l1)
		 (next ?l2 ?l1)
		 (next ?l3 ?l2)
		)
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l3)
	)
) 

(:action refuel
 :parameters (?a - aircraft ?c - city ?l - flevel ?l1 - flevel)

 :precondition (and (fuel-level ?a ?l)
                 (next ?l ?l1)
                 (at ?a ?c))
 :effect (and (fuel-level ?a ?l1) (not (fuel-level ?a ?l))))


)

; problem
(define (problem ZTRAVEL-2-4)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city0)
	(fuel-level plane1 fl3)
	(at plane2 city0)
	(fuel-level plane2 fl6)
	(at person1 city0)
	(at person2 city1)
	(at person3 city2)
	(at person4 city2)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane2 city1)
	(at person1 city3)
	(at person2 city1)
	(at person3 city2)
	(at person4 city3)
	))

)

; plan
1. (fly plane2 city0 city1 fl6 fl5)
   deleted: (at plane2 city0) (fuel-level plane2 fl6)
   added: (at plane2 city1) (fuel-level plane2 fl5)
   goals met: 3 of 5
2. (board person1 plane1 city0)
   deleted: (at person1 city0)
   added: (in person1 plane1)
   goals met: 3 of 5
3. (fly plane1 city0 city2 fl3 fl2)
   deleted: (at plane1 city0) (fuel-level plane1 fl3)
   added: (at plane1 city2) (fuel-level plane1 fl2)
   goals met: 3 of 5
4. (board person4 plane1 city2)
   deleted: (at person4 city2)
   added: (in person4 plane1)
   goals met: 3 of 5
5. (fly plane1 city2 city3 fl2 fl1)
   deleted: (at plane1 city2) (fuel-level plane1 fl2)
   added: (at plane1 city3) (fuel-level plane1 fl1)
   goals met: 3 of 5
6. (debark person4 plane1 city3)
   deleted: (in person4 plane1)
   added: (at person4 city3)
   goals met: 4 of 5
7. (debark person1 plane1 city3)
   deleted: (in person1 plane1)
   added: (at person1 city3)
   goals met: 5 of 5
